{
    "_name_or_path": "custom-model",
    "architectures": [
      "CustomModel"
    ],
    "attention_probs_dropout_prob": 0.1,
    "classifier_dropout": null,
    "gradient_checkpointing": false,
    "hidden_act": "gelu",
    "hidden_dropout_prob": 0.1,
    "hidden_size": 768,
    "id2label": {
      "0": "human",
      "1": "chatGPT",
      "2": "cohere",
      "3": "davinci",
      "4": "bloomz",
      "5": "dolly"
    },
    "initializer_range": 0.02,
    "intermediate_size": 3072,
    "label2id": {
      "bloomz": 4,
      "chatGPT": 1,
      "cohere": 2,
      "davinci": 3,
      "dolly": 5,
      "human": 0
    },
    "layer_norm_eps": 1e-12,
    "max_position_embeddings": 512,
    "model_type": "custom",
    "num_attention_heads": 12,
    "num_hidden_layers": 12,
    "pad_token_id": 0,
    "position_embedding_type": "absolute",
    "problem_type": "single_label_classification",
    "torch_dtype": "float32",
    "transformers_version": "4.33.3",
    "type_vocab_size": 2,
    "use_cache": true,
    "custom_dense_layer_size": 768,
    "vocab_size": 28996
  }
  